<a href="https://colab.research.google.com/github/elvissounna/Projet_IA/blob/main/week_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Mounted at /content/drive

In [ ]:
import os
import pandas as pd
import numpy as np
import matplotlib_inline
import matplotlib.pyplot as plt
os.chdir("/content/drive/MyDrive/DataSets/DataSets")

In [ ]:
#Visualization and analysis of Cab_Data file.
cab = pd.read_csv("Cab_data.csv")
cab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  object
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 19.2+ MB

In [ ]:
#Affichons les premières lignes du DataSet ainsi que sa taille
print(cab.head(30))
print(cab.shape)

    Transaction ID Date of Travel   Company        City  KM Travelled  \
0         10000011     08-01-2016  Pink Cab  ATLANTA GA         30.45
1         10000012     06-01-2016  Pink Cab  ATLANTA GA         28.62
2         10000013     02-01-2016  Pink Cab  ATLANTA GA          9.04
3         10000014     07-01-2016  Pink Cab  ATLANTA GA         33.17
4         10000015     03-01-2016  Pink Cab  ATLANTA GA          8.73
5         10000016     07-01-2016  Pink Cab  ATLANTA GA          6.06
6         10000017     03-01-2016  Pink Cab   AUSTIN TX         44.00
7         10000018     07-01-2016  Pink Cab   AUSTIN TX         35.65
8         10000019     12-01-2016  Pink Cab   BOSTON MA         14.40
9         10000020     06-01-2016  Pink Cab   BOSTON MA         10.89
10        10000021     11-01-2016  Pink Cab   BOSTON MA         39.60
11        10000022     06-01-2016  Pink Cab   BOSTON MA         21.80
12        10000023     11-01-2016  Pink Cab   BOSTON MA         12.00
13        10000024     06-01-2016  Pink Cab   BOSTON MA         32.67
14        10000025     08-01-2016  Pink Cab   BOSTON MA         25.52
15        10000026     10-01-2016  Pink Cab   BOSTON MA         15.54
16        10000027     07-01-2016  Pink Cab   BOSTON MA          6.65
17        10000028     08-01-2016  Pink Cab   BOSTON MA         34.22
18        10000029     02-01-2016  Pink Cab   BOSTON MA         21.34
19        10000030     02-01-2016  Pink Cab   BOSTON MA         41.30
20        10000031     06-01-2016  Pink Cab   BOSTON MA          1.96
21        10000032     07-01-2016  Pink Cab   BOSTON MA         13.44
22        10000033     12-01-2016  Pink Cab   BOSTON MA         23.40
23        10000034     03-01-2016  Pink Cab  CHICAGO IL         23.20
24        10000035     09-01-2016  Pink Cab  CHICAGO IL          4.48
25        10000036     11-01-2016  Pink Cab  CHICAGO IL         37.76
26        10000037     11-01-2016  Pink Cab  CHICAGO IL         14.56
27        10000038     08-01-2016  Pink Cab  CHICAGO IL         39.55
28        10000039     10-01-2016  Pink Cab  CHICAGO IL          6.66
29        10000040     07-01-2016  Pink Cab  CHICAGO IL         37.05

    Price Charged  Cost of Trip
0          370.95       313.635
1          358.52       334.854
2          125.20        97.632
3          377.40       351.602
4          114.62        97.776
5           72.43        63.024
6          576.15       475.200
7          466.10       377.890
8          191.61       146.880
9          156.98       113.256
10         570.83       475.200
11         317.27       220.180
12         158.01       134.400
13         470.94       392.040
14         360.79       298.584
15         234.78       169.386
16         101.39        76.475
17         498.02       407.218
18         324.21       226.204
19         646.06       454.300
20          27.71        20.776
21         193.74       145.152
22         295.15       259.740
23         396.73       278.400
24          55.27        51.520
25         541.76       407.808
26         191.33       171.808
27         540.93       454.825
28          95.55        68.598
29         447.12       381.615
(359392, 7)

In [ ]:
# Visualisons le nombre de données manquantes pour chaque variable
cab.isna().sum()

Transaction ID    0
Date of Travel    0
Company           0
City              0
KM Travelled      0
Price Charged     0
Cost of Trip      0
dtype: int64

In [ ]:
print(cab["Date of Travel"].dtypes)
# On peut remarquer que le format n'est pas celui indiqué pour indiquer la date.
# Nous allons donc le convertir

object

In [ ]:
# revisualisons le dataset
print(cab['Date of Travel'])

0         08-01-2016
1         06-01-2016
2         02-01-2016
3         07-01-2016
4         03-01-2016
             ...
359387    08-01-2018
359388    04-01-2018
359389    05-01-2018
359390    05-01-2018
359391    02-01-2018
Name: Date of Travel, Length: 359392, dtype: object

In [ ]:
cab['Date of Travel']  = pd.to_datetime(cab['Date of Travel'] ).dt.date
cab.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,1970-01-01,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,1970-01-01,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,1970-01-01,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,1970-01-01,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,1970-01-01,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [ ]:
# On peut faire une visions statistique élémentaire globale sur notre jeu de données
print(cab.describe(include = 'all'))

        Transaction ID Date of Travel     Company         City   KM Travelled  \
count     3.593920e+05         359392      359392       359392  359392.000000
unique             NaN           1095           2           19            NaN
top                NaN     05-01-2018  Yellow Cab  NEW YORK NY            NaN
freq               NaN           2022      274681        99885            NaN
mean      1.022076e+07            NaN         NaN          NaN      22.567254
std       1.268058e+05            NaN         NaN          NaN      12.233526
min       1.000001e+07            NaN         NaN          NaN       1.900000
25%       1.011081e+07            NaN         NaN          NaN      12.000000
50%       1.022104e+07            NaN         NaN          NaN      22.440000
75%       1.033094e+07            NaN         NaN          NaN      32.960000
max       1.044011e+07            NaN         NaN          NaN      48.000000

        Price Charged   Cost of Trip
count   359392.000000  359392.000000
unique            NaN            NaN
top               NaN            NaN
freq              NaN            NaN
mean       423.443311     286.190113
std        274.378911     157.993661
min         15.600000      19.000000
25%        206.437500     151.200000
50%        386.360000     282.480000
75%        583.660000     413.683200
max       2048.030000     691.200000

In [ ]:
#Visualisation of City.csv file

In [ ]:
city = pd.read_csv("City.csv")
print(city.head(15))
print(city.info())

                City   Population      Users
0        NEW YORK NY   8,405,837    302,149
1         CHICAGO IL   1,955,130    164,468
2     LOS ANGELES CA   1,595,037    144,132
3           MIAMI FL   1,339,155     17,675
4     SILICON VALLEY   1,177,609     27,247
5      ORANGE COUNTY   1,030,185     12,994
6       SAN DIEGO CA     959,307     69,995
7         PHOENIX AZ     943,999      6,133
8          DALLAS TX     942,908     22,157
9         ATLANTA GA     814,885     24,701
10         DENVER CO     754,233     12,421
11         AUSTIN TX     698,371     14,978
12        SEATTLE WA     671,238     25,063
13         TUCSON AZ     631,442      5,712
14  SAN FRANCISCO CA     629,591    213,609
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes
None

In [ ]:
#Visualisation and analysis of Customer_ID.csv

In [ ]:
customer = pd.read_csv("Customer_ID.csv")
print(customer.head(15))

    Customer ID Gender  Age  Income (USD/Month)
0         29290   Male   28               10813
1         27703   Male   27                9237
2         28712   Male   53               11242
3         28020   Male   23               23327
4         27182   Male   33                8536
5         27318   Male   25               13984
6         33788   Male   23               23788
7         34106   Male   19               19980
8         59799   Male   33               19271
9         57982   Male   57                5068
10        58774   Male   20               23602
11        58627   Male   28               27338
12        59007   Male   63                6683
13        58215   Male   25                6862
14        59372   Male   53                4912

In [ ]:
# Visualisation and analysis of Trnsaction_ID.csv file

In [ ]:
transaction = pd.read_csv("Transaction_ID.csv")
print(transaction.head(15))
print(transaction.shape)

    Transaction ID  Customer ID Payment_Mode
0         10000011        29290         Card
1         10000012        27703         Card
2         10000013        28712         Cash
3         10000014        28020         Cash
4         10000015        27182         Card
5         10000016        27318         Cash
6         10000017        33788         Card
7         10000018        34106         Card
8         10000019        59799         Cash
9         10000020        57982         Cash
10        10000021        58774         Cash
11        10000022        58627         Card
12        10000023        59007         Card
13        10000024        58215         Cash
14        10000025        59372         Cash
(440098, 3)

In [ ]:
#transaction['Payment_Mode']
cash = transaction.loc[transaction['Payment_Mode'] == "Cash"]
print(cash.head())
print(cash.shape)

   Transaction ID  Customer ID Payment_Mode
2        10000013        28712         Cash
3        10000014        28020         Cash
5        10000016        27318         Cash
8        10000019        59799         Cash
9        10000020        57982         Cash
(176107, 3)

In [ ]:
440098-176107

263991